In [1]:
import pandas as pd

In [4]:
entries ={
    'maths' :[50,45,30,45,40],
    'science' :[45,50,40,30,20]
}

In [5]:
df1 = pd.DataFrame(entries)

In [6]:
df1

   maths  science
0     50       45
1     45       50
2     30       40
3     45       30
4     40       20

In [7]:
df1['maths']

0    50
1    45
2    30
3    45
4    40
Name: maths, dtype: int64

In [8]:
df1.loc[0]

maths      50
science    45
Name: 0, dtype: int64

In [10]:
df1[df1['maths']> 40 ]

   maths  science
0     50       45
1     45       50
3     45       30

In [11]:
df1[(df1['maths']> 40) & (df1['science']>30) ]

   maths  science
0     50       45
1     45       50

In [14]:
entries2 ={
    'maths' :[50,35,50,35,30],
    'science' :[15,30,30,20,25]
}

In [15]:
df2=pd.DataFrame(entries2)

In [16]:
df2

   maths  science
0     50       15
1     35       30
2     50       30
3     35       20
4     30       25

In [18]:
df3 = pd.concat([df1,df2])

In [19]:
df3

   maths  science
0     50       45
1     45       50
2     30       40
3     45       30
4     40       20
0     50       15
1     35       30
2     50       30
3     35       20
4     30       25

In [20]:
df3 = df3.reset_index()

In [21]:
df3

   index  maths  science
0      0     50       45
1      1     45       50
2      2     30       40
3      3     45       30
4      4     40       20
5      0     50       15
6      1     35       30
7      2     50       30
8      3     35       20
9      4     30       25

In [22]:
def add_maths_science(row):
    return row['maths']+row['science']

In [23]:
df3['total'] = df3.apply(add_maths_science, axis=1)

In [24]:
df3

   index  maths  science  total
0      0     50       45     95
1      1     45       50     95
2      2     30       40     70
3      3     45       30     75
4      4     40       20     60
5      0     50       15     65
6      1     35       30     65
7      2     50       30     80
8      3     35       20     55
9      4     30       25     55

In [25]:
df3 = df3.drop(['index'],axis=1)

In [26]:
df3

   maths  science  total
0     50       45     95
1     45       50     95
2     30       40     70
3     45       30     75
4     40       20     60
5     50       15     65
6     35       30     65
7     50       30     80
8     35       20     55
9     30       25     55

In [ ]:
entries2 ={
    'maths' :[50,[None]],
    'science' :[45,55]
}